{
    "quotes": [
        {
            "quote": "I'm not lazy, I'm on energy-saving mode.",
            "author": "Ninja Type"
        },
        {
            "quote": "I told my wife she was drawing her eyebrows too high. She looked surprised.",
            "author": "Ninja Type"
        },
        {
            "quote": "I used to think I was indecisive, but now I'm not so sure.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm on a seafood diet. I see food and I eat it.",
            "author": "Ninja Type"
        },
        {
            "quote": "I don't mean to interrupt people. I just randomly remember things and get really excited.",
            "author": "Ninja Type"
        },
        {
            "quote": "My bed is a magical place where I suddenly remember everything I was supposed to do.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not arguing, I'm just explaining why I'm right.",
            "author": "Ninja Type"
        },
        {
            "quote": "The trouble with being punctual is that nobody's there to appreciate it.",
            "author": "Franklin P. Jones"
        },
        {
            "quote": "I'm not clumsy. It's just the floor hates me, the tables and chairs are bullies, and the walls get in my way.",
            "author": "Ninja Type"
        },
        {
            "quote": "I exercise every morning. Absolutely nothing is wrong with my lying skills.",
            "author": "Ninja Type"
        },
        {
            "quote": "My people skills are just fine. It's my tolerance for idiots that needs work.",
            "author": "Ninja Type"
        },
        {
            "quote": "I don't need a hairstylist. My pillow gives me a new hairstyle every morning.",
            "author": "Ninja Type"
        },
        {
            "quote": "The easiest way to find something lost around the house is to buy a replacement.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not short, I'm concentrated awesome.",
            "author": "Ninja Type"
        },
        {
            "quote": "You know you're an adult when you get excited about a new vacuum cleaner.",
            "author": "Ninja Type"
        },
        {
            "quote": "Common sense is like deodorant. The people who need it most never use it.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not saying I'm Batman. I'm just saying no one has ever seen me and Batman in the same room.",
            "author": "Ninja Type"
        },
        {
            "quote": "A clear conscience is usually the sign of a bad memory.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not a complete idiot, some parts are missing.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not procrastinating. I'm just doing side quests.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not a morning person. If you want to see me at my best, come back after noon.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not a hoarder, I'm just extremely helpful in case anyone needs 17 empty margarine tubs.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not old, I'm retro.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not arguing, I'm just passionately expressing my point of view while being completely right.",
            "author": "Ninja Type"
        },
        {
            "quote": "I don't make mistakes. I create unexpected learning opportunities.",
            "author": "Ninja Type"
        },
        {
            "quote": "My brain has two modes: Forget everything and remember that embarrassing thing you did 10 years ago.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not ignoring you, I'm just assembling my reply in my head.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not a control freak. Now, can you please move? You're standing too close to the line I drew.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not saying I'm Wonder Woman, I'm just saying no one has ever seen me and Wonder Woman in the same room.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not a vegetarian because I love animals. I'm a vegetarian because I hate plants.",
            "author": "A. Whitney Brown"
        },
        {
            "quote": "I'm not great at advice. Can I interest you in a sarcastic comment?",
            "author": "Ninja Type"
        },
        {
            "quote": "My favorite exercise is a cross between a lunge and a crunch. It's called lunch.",
            "author": "Ninja Type"
        },
        {
            "quote": "I don't suffer from insanity. I enjoy every minute of it.",
            "author": "Ninja Type"
        },
        {
            "quote": "I have a hobby. I have the world's largest collection of sea shells. I keep it scattered on beaches all over the world. Maybe you've seen it.",
            "author": "Steven Wright"
        },
        {
            "quote": "I'm not lazy, I'm just very relaxed.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not procrastinating. I'm just prioritizing my immediate happiness.",
            "author": "Ninja Type"
        },
        {
            "quote": "I am so good at sleeping I can do it with my eyes closed.",
            "author": "Ninja Type"
        },
        {
            "quote": "My brain is 90% song lyrics, 8% worry, and 2% remembering to put the laundry in the dryer.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not lazy, I'm in energy-saving mode.",
            "author": "Ninja Type"
        },
        {
            "quote": "I have a GPS in my car. It keeps telling me to 'proceed to the route.' I'm already on the route! What does it want from me?!",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not a hoarder, I'm a collector of potential future usefulness.",
            "author": "Ninja Type"
        },
        {
            "quote": "My social security number is 1. Because I'm the first person you should call.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not clumsy. The floor is just uneven, the tables are out to get me, and the walls jump in front of me.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not a morning person. I'm a 'need several coffees before I can even remember my own name' person.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not addicted to coffee. We're just in a committed relationship.",
            "author": "Ninja Type"
        },
        {
            "quote": "My wallet is like an onion. Opening it makes me cry.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not weird. I'm limited edition.",
            "author": "Ninja Type"
        },
        {
            "quote": "I speak fluent sarcasm and a little bit of common sense.",
            "author": "Ninja Type"
        },
        {
            "quote": "I put the 'Pro' in procrastination.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not bossy. I just have better ideas.",
            "author": "Ninja Type"
        },
        {
            "quote": "My room is not messy. It's an obstacle course designed to keep me fit.",
            "author": "Ninja Type"
        },
        {
            "quote": "I don't have a short attention span. I just... oh look, a squirrel!",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not always right, but I'm never wrong.",
            "author": "Ninja Type"
        },
        {
            "quote": "My superpower is making people uncomfortable by being honest.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not antisocial. I'm selectively social.",
            "author": "Ninja Type"
        },
        {
            "quote": "I don't need anger management. I need people to stop annoying me.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not late. Everyone else is just too early.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm on a 30-day diet. So far, I've lost 15 days.",
            "author": "Ninja Type"
        },
        {
            "quote": "I don't trip. I do random gravity checks.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not stubborn. My way is just better.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not sarcastic. I'm just intelligent beyond your understanding.",
            "author": "Ninja Type"
        },
        {
            "quote": "My bed and I are perfect for each other, but my alarm clock keeps trying to break us up.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not avoiding work. I'm just on an extended mental health break.",
            "author": "Ninja Type"
        },
        {
            "quote": "I don't need Google. My wife knows everything.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not overdramatic. I'm just emotionally theatrical.",
            "author": "Ninja Type"
        },
        {
            "quote": "I don't snore. I dream I'm a motorcycle.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not forgetful. I just have a selective memory.",
            "author": "Ninja Type"
        },
        {
            "quote": "My life feels like a test I didn't study for.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not messy. I'm creatively organized.",
            "author": "Ninja Type"
        },
        {
            "quote": "I don't have a dirty mind. I have a sexy imagination.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not clumsy. I'm just testing gravity. It still works.",
            "author": "Ninja Type"
        },
        {
            "quote": "My brain: You need to sleep. Also my brain at 3 AM: Remember that embarrassing thing from 10 years ago?",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not indecisive. Or am I?",
            "author": "Ninja Type"
        },
        {
            "quote": "I don't need therapy. I just need a vacation.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not talkative. I just have a lot of important things to say.",
            "author": "Ninja Type"
        },
        {
            "quote": "My favorite machine at the gym is the vending machine.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not overthinking. I'm just thinking at Olympic levels.",
            "author": "Ninja Type"
        },
        {
            "quote": "I don't gossip. I just share enhanced news.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not dramatic. I'm just passionately expressive.",
            "author": "Ninja Type"
        },
        {
            "quote": "My room isn't messy. It's an organized chaos system.",
            "author": "Ninja Type"
        },
        {
            "quote": "I don't have an attitude problem. You have a perception problem.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not addicted to my phone. I'm in a long-term relationship with it.",
            "author": "Ninja Type"
        },
        {
            "quote": "I don't need a hairstylist. My pillow creates new styles every night.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not avoiding responsibilities. I'm just giving them space.",
            "author": "Ninja Type"
        },
        {
            "quote": "My life is basically just me wondering if it's too early or too late for coffee.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not grumpy. I just have a low tolerance for stupidity.",
            "author": "Ninja Type"
        },
        {
            "quote": "I don't lose things. I just temporarily misplace them for months.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not impatient. I just want things to happen at my desired speed.",
            "author": "Ninja Type"
        },
        {
            "quote": "My hobbies include eating and complaining that I'm getting fat.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not avoiding people. I'm practicing social distancing before it was cool.",
            "author": "Ninja Type"
        },
        {
            "quote": "I don't age. I level up.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not cheap. I'm financially selective.",
            "author": "Ninja Type"
        },
        {
            "quote": "My brain has too many tabs open.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not procrastinating. I'm strategically delaying success.",
            "author": "Ninja Type"
        },
        {
            "quote": "I don't need motivation. I need a deadline and panic.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not addicted to social media. I can quit anytime. Right after this scroll.",
            "author": "Ninja Type"
        },
        {
            "quote": "My life is a constant battle between wanting to be productive and wanting to take a nap.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not disorganized. I'm spontaneously arranging things.",
            "author": "Ninja Type"
        },
        {
            "quote": "I don't have road rage. I have driving passion.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not a quitter. I'm just on a permanent coffee break.",
            "author": "Ninja Type"
        },
        {
            "quote": "My fitness goal is to be able to clip my toenails without grunting.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not nosy. I'm just highly interested in your business.",
            "author": "Ninja Type"
        },
        {
            "quote": "I don't snack. I have strategic small meals throughout the day.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not forgetful. I'm just efficient at clearing my mental cache.",
            "author": "Ninja Type"
        },
        {
            "quote": "My idea of meal prep is deciding which restaurant to order from.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not moody. I'm just emotionally flexible.",
            "author": "Ninja Type"
        },
        {
            "quote": "I don't binge-watch shows. I'm just very committed to my entertainment.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not picky. I just know what I want, and it's not that.",
            "author": "Ninja Type"
        },
        {
            "quote": "My resume is just a list of things I can Google.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not lost. I'm just exploring alternative routes.",
            "author": "Ninja Type"
        },
        {
            "quote": "I don't have trust issues. I just have experience.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not boring. You just don't appreciate my sophisticated sense of humor.",
            "author": "Ninja Type"
        },
        {
            "quote": "My idea of a balanced diet is a cookie in each hand.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not avoiding exercise. I'm just saving my energy for important things.",
            "author": "Ninja Type"
        },
        {
            "quote": "I don't text back slowly. I'm just carefully crafting my response.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not addicted to online shopping. I'm supporting the economy.",
            "author": "Ninja Type"
        },
        {
            "quote": "My cooking style is best described as 'experimental hazard.'",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not avoiding phone calls. I'm preserving my mental energy.",
            "author": "Ninja Type"
        },
        {
            "quote": "I don't hoard things. I'm a curator of potentially useful items.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not high maintenance. I'm just worth the effort.",
            "author": "Ninja Type"
        },
        {
            "quote": "My superpower is being able to sleep through any alarm.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not jealous. I'm just noticing what should be mine.",
            "author": "Ninja Type"
        },
        {
            "quote": "I don't procrastinate. I prioritize last-minute productivity.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not bad with names. I'm just excellent at forgetting them.",
            "author": "Ninja Type"
        },
        {
            "quote": "My life motto: Why do today what you can put off until tomorrow?",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not ignoring you. I'm just prioritizing my peace.",
            "author": "Ninja Type"
        },
        {
            "quote": "I don't need a GPS. I have overconfidence and poor decision-making skills.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not overthinking. I'm just exploring all possible worst-case scenarios.",
            "author": "Ninja Type"
        },
        {
            "quote": "My life is like a romantic comedy, minus the romance and the comedy.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not multitasking. I'm just doing multiple things badly at once.",
            "author": "Ninja Type"
        },
        {
            "quote": "I don't have a favorite child. I dislike all my responsibilities equally.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not living beyond my means. My means need to catch up with me.",
            "author": "Ninja Type"
        },
        {
            "quote": "My idea of extreme sports is walking up the stairs without getting winded.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not paranoid. Everyone really is out to get me.",
            "author": "Ninja Type"
        },
        {
            "quote": "I don't have a drinking problem. I drink, I get drunk, I fall down. No problem.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not a shopaholic. I'm helping the retail industry thrive.",
            "author": "Ninja Type"
        },
        {
            "quote": "My life plan is basically just winging it with confidence.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not judging you. I'm just silently noting your poor life choices.",
            "author": "Ninja Type"
        },
        {
            "quote": "I don't have a sleep schedule. Sleep just happens when my body gives up.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not addicted to my bed. We're just in a deeply committed relationship.",
            "author": "Ninja Type"
        },
        {
            "quote": "My tolerance for mornings is directly proportional to my caffeine intake.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not a night owl or an early bird. I'm some form of permanently exhausted pigeon.",
            "author": "Ninja Type"
        }
    ]
}