{
    "quotes": [
        {
            "quote": "I'm not lazy, I'm on energy-saving mode.",
            "author": "Ninja Type"
        },
        {
            "quote": "I told my wife she was drawing her eyebrows too high. She looked surprised.",
            "author": "Ninja Type"
        },
        {
            "quote": "I used to think I was indecisive, but now I'm not so sure.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm on a seafood diet. I see food and I eat it.",
            "author": "Ninja Type"
        },
        {
            "quote": "I don't mean to interrupt people. I just randomly remember things and get really excited.",
            "author": "Ninja Type"
        },
        {
            "quote": "My bed is a magical place where I suddenly remember everything I was supposed to do.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not arguing, I'm just explaining why I'm right.",
            "author": "Ninja Type"
        },
        {
            "quote": "The trouble with being punctual is that nobody's there to appreciate it.",
            "author": "Franklin P. Jones"
        },
        {
            "quote": "I'm not clumsy. It's just the floor hates me, the tables and chairs are bullies, and the walls get in my way.",
            "author": "Ninja Type"
        },
        {
            "quote": "I exercise every morning. Absolutely nothing is wrong with my lying skills.",
            "author": "Ninja Type"
        },
        {
            "quote": "My people skills are just fine. It's my tolerance for idiots that needs work.",
            "author": "Ninja Type"
        },
        {
            "quote": "I don't need a hairstylist. My pillow gives me a new hairstyle every morning.",
            "author": "Ninja Type"
        },
        {
            "quote": "The easiest way to find something lost around the house is to buy a replacement.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not short, I'm concentrated awesome.",
            "author": "Ninja Type"
        },
        {
            "quote": "You know you're an adult when you get excited about a new vacuum cleaner.",
            "author": "Ninja Type"
        },
        {
            "quote": "Common sense is like deodorant. The people who need it most never use it.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not saying I'm Batman. I'm just saying no one has ever seen me and Batman in the same room.",
            "author": "Ninja Type"
        },
        {
            "quote": "A clear conscience is usually the sign of a bad memory.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not a complete idiot, some parts are missing.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not procrastinating. I'm just doing side quests.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not a morning person. If you want to see me at my best, come back after noon.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not a hoarder, I'm just extremely helpful in case anyone needs 17 empty margarine tubs.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not old, I'm retro.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not arguing, I'm just passionately expressing my point of view while being completely right.",
            "author": "Ninja Type"
        },
        {
            "quote": "I don't make mistakes. I create unexpected learning opportunities.",
            "author": "Ninja Type"
        },
        {
            "quote": "My brain has two modes: Forget everything and remember that embarrassing thing you did 10 years ago.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not ignoring you, I'm just assembling my reply in my head.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not a control freak. Now, can you please move? You're standing too close to the line I drew.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not saying I'm Wonder Woman, I'm just saying no one has ever seen me and Wonder Woman in the same room.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not a vegetarian because I love animals. I'm a vegetarian because I hate plants.",
            "author": "A. Whitney Brown"
        },
        {
            "quote": "I'm not great at advice. Can I interest you in a sarcastic comment?",
            "author": "Ninja Type"
        },
        {
            "quote": "My favorite exercise is a cross between a lunge and a crunch. It's called lunch.",
            "author": "Ninja Type"
        },
        {
            "quote": "I don't suffer from insanity. I enjoy every minute of it.",
            "author": "Ninja Type"
        },
        {
            "quote": "I have a hobby. I have the world's largest collection of sea shells. I keep it scattered on beaches all over the world. Maybe you've seen it.",
            "author": "Steven Wright"
        },
        {
            "quote": "I'm not lazy, I'm just very relaxed.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not procrastinating. I'm just prioritizing my immediate happiness.",
            "author": "Ninja Type"
        },
        {
            "quote": "I am so good at sleeping I can do it with my eyes closed.",
            "author": "Ninja Type"
        },
        {
            "quote": "My brain is 90% song lyrics, 8% worry, and 2% remembering to put the laundry in the dryer.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not lazy, I'm in energy-saving mode.",
            "author": "Ninja Type"
        },
        {
            "quote": "I have a GPS in my car. It keeps telling me to 'proceed to the route.' I'm already on the route! What does it want from me?!",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not a hoarder, I'm a collector of potential future usefulness.",
            "author": "Ninja Type"
        },
        {
            "quote": "My social security number is 1. Because I'm the first person you should call.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not clumsy. The floor is just uneven, the tables are out to get me, and the walls jump in front of me.",
            "author": "Ninja Type"
        },
        {
            "quote": "I'm not a morning person. I'm a 'need several coffees before I can even remember my own name' person.",
            "author": "Ninja Type"
        }
    ]
}