{
    "quotes": [
        {
            "quote": "Any fool can write code that a computer can understand. Good programmers write code that humans can understand.",
            "author": "Martin Fowler"
        },
        {
            "quote": "First, solve the problem. Then, write the code.",
            "author": "John Johnson"
        },
        {
            "quote": "Code is like humor. When you have to explain it, it's bad.",
            "author": "Cory House"
        },
        {
            "quote": "Programming isn't about what you know; it's about what you can figure out.",
            "author": "Chris Pine"
        },
        {
            "quote": "The best error message is the one that never shows up.",
            "author": "Thomas Fuchs"
        },
        {
            "quote": "Simplicity is the soul of efficiency.",
            "author": "Austin Freeman"
        },
        {
            "quote": "Before software can be reusable it first has to be usable.",
            "author": "Ralph Johnson"
        },
        {
            "quote": "Make it work, make it right, make it fast.",
            "author": "Kent Beck"
        },
        {
            "quote": "Clean code always looks like it was written by someone who cares.",
            "author": "Robert C. Martin"
        },
        {
            "quote": "It's not a bug – it's an undocumented feature.",
            "author": "Anonymous"
        },
        {
            "quote": "Fix the cause, not the symptom.",
            "author": "Steve Maguire"
        },
        {
            "quote": "Code never lies, comments sometimes do.",
            "author": "Ron Jeffries"
        },
        {
            "quote": "Deleted code is debugged code.",
            "author": "Jeff Sickel"
        },
        {
            "quote": "There are only two hard things in Computer Science: cache invalidation and naming things.",
            "author": "Phil Karlton"
        },
        {
            "quote": "Walking on water and developing software from a specification are easy if both are frozen.",
            "author": "Edward V. Berard"
        },
        {
            "quote": "The most disastrous thing that you can ever learn is your first programming language.",
            "author": "Alan Kay"
        },
        {
            "quote": "Programs must be written for people to read, and only incidentally for machines to execute.",
            "author": "Harold Abelson"
        },
        {
            "quote": "Truth can only be found in one place: the code.",
            "author": "Robert C. Martin"
        },
        {
            "quote": "Optimism is an occupational hazard of programming: feedback is the treatment.",
            "author": "Kent Beck"
        },
        {
            "quote": "One of my most productive days was throwing away 1000 lines of code.",
            "author": "Ken Thompson"
        },
        {
            "quote": "Don't comment bad code – rewrite it.",
            "author": "Brian Kernighan"
        },
        {
            "quote": "Measuring programming progress by lines of code is like measuring aircraft building progress by weight.",
            "author": "Bill Gates"
        },
        {
            "quote": "Debugging is twice as hard as writing the code in the first place.",
            "author": "Brian Kernighan"
        },
        {
            "quote": "The function of good software is to make the complex appear to be simple.",
            "author": "Grady Booch"
        },
        {
            "quote": "Talk is cheap. Show me the code.",
            "author": "Linus Torvalds"
        },
        {
            "quote": "If debugging is the process of removing bugs, then programming must be the process of putting them in.",
            "author": "Edsger Dijkstra"
        },
        {
            "quote": "Experience is the name everyone gives to their mistakes.",
            "author": "Oscar Wilde"
        },
        {
            "quote": "In programming, the hard part isn't solving problems, but deciding what problems to solve.",
            "author": "Paul Graham"
        },
        {
            "quote": "Programming is the art of telling another human what one wants the computer to do.",
            "author": "Donald Knuth"
        },
        {
            "quote": "Without requirements or design, programming is the art of adding bugs to an empty quote file.",
            "author": "Louis Srygley"
        },
        {
            "quote": "Good code is its own best documentation.",
            "author": "Steve McConnell"
        },
        {
            "quote": "Premature optimization is the root of all evil.",
            "author": "Donald Knuth"
        },
        {
            "quote": "Sometimes it pays to stay in bed on Monday, rather than spending the rest of the week debugging Monday's code.",
            "author": "Dan Salomon"
        },
        {
            "quote": "The best way to get a project done faster is to start sooner.",
            "author": "Jim Highsmith"
        },
        {
            "quote": "Every great developer you know got there by solving problems they were unqualified to solve until they actually did it.",
            "author": "Patrick McKenzie"
        },
        {
            "quote": "There are two ways to write error-free programs; only the third one works.",
            "author": "Alan Perlis"
        },
        {
            "quote": "The computer was born to solve problems that did not exist before.",
            "author": "Bill Gates"
        },
        {
            "quote": "A language that doesn't affect the way you think about programming is not worth knowing.",
            "author": "Alan Perlis"
        },
        {
            "quote": "Testing leads to failure, and failure leads to understanding.",
            "author": "Burt Rutan"
        },
        {
            "quote": "Controlling complexity is the essence of computer programming.",
            "author": "Brian Kernighan"
        },
        {
            "quote": "Most good programmers do programming not because they expect to get paid or get adulation by the public, but because it is fun to program.",
            "author": "Linus Torvalds"
        },
        {
            "quote": "Always code as if the guy who ends up maintaining your code will be a violent psychopath who knows where you live.",
            "author": "John Woods"
        },
        {
            "quote": "Software is a great combination between artistry and engineering.",
            "author": "Bill Gates"
        },
        {
            "quote": "The only way to learn a new programming language is by writing programs in it.",
            "author": "Dennis Ritchie"
        },
        {
            "quote": "It's harder to read code than to write it.",
            "author": "Joel Spolsky"
        },
        {
            "quote": "The best programs are the ones written when the programmer is supposed to be working on something else.",
            "author": "Melinda Varian"
        },
        {
            "quote": "Writing code is easy. Writing code that works is hard.",
            "author": "Anonymous"
        },
        {
            "quote": "Simplicity is prerequisite for reliability.",
            "author": "Edsger Dijkstra"
        },
        {
            "quote": "Design patterns should not be applied indiscriminately. Often they achieve flexibility and variability by introducing additional levels of indirection, and that can complicate a design.",
            "author": "Gang of Four"
        },
        {
            "quote": "The cheapest, fastest, and most reliable components are those that aren't there.",
            "author": "Gordon Bell"
        },
        {
            "quote": "Java is to JavaScript what car is to carpet.",
            "author": "Chris Heilmann"
        },
        {
            "quote": "I'm not a great programmer; I'm just a good programmer with great habits.",
            "author": "Kent Beck"
        },
        {
            "quote": "The trouble with programmers is that you can never tell what a programmer is doing until it's too late.",
            "author": "Seymour Cray"
        },
        {
            "quote": "Software and cathedrals are much the same – first we build them, then we pray.",
            "author": "Sam Redwine"
        },
        {
            "quote": "The best thing about a boolean is even if you are wrong, you are only off by a bit.",
            "author": "Anonymous"
        },
        {
            "quote": "There's no place like 127.0.0.1.",
            "author": "Anonymous"
        },
        {
            "quote": "It works on my machine.",
            "author": "Every Developer"
        },
        {
            "quote": "Weeks of coding can save you hours of planning.",
            "author": "Anonymous"
        },
        {
            "quote": "A good programmer is someone who always looks both ways before crossing a one-way street.",
            "author": "Doug Linder"
        },
        {
            "quote": "Copy-and-paste was programmed by programmers for programmers.",
            "author": "Anonymous"
        },
        {
            "quote": "Programming is 10% science, 20% ingenuity, and 70% getting the ingenuity to work with the science.",
            "author": "Anonymous"
        },
        {
            "quote": "Software undergoes beta testing shortly before it's released. Beta is Latin for 'still doesn't work'.",
            "author": "Anonymous"
        },
        {
            "quote": "Real programmers don't comment their code. If it was hard to write, it should be hard to understand.",
            "author": "Anonymous"
        },
        {
            "quote": "I don't care if it works on your machine! We are not shipping your machine!",
            "author": "Vidiu Platon"
        },
        {
            "quote": "To err is human, but to really foul things up you need a computer.",
            "author": "Paul R. Ehrlich"
        },
        {
            "quote": "Programming today is a race between software engineers striving to build bigger and better idiot-proof programs, and the Universe trying to produce bigger and better idiots.",
            "author": "Rick Cook"
        },
        {
            "quote": "Always code as if the person who ends up maintaining your code is a violent psychopath who knows where you live.",
            "author": "Martin Golding"
        },
        {
            "quote": "Documentation is like sex: when it's good, it's very good, and when it's bad, it's better than nothing.",
            "author": "Dick Brandon"
        },
        {
            "quote": "There are only two kinds of programming languages: those people always complain about and those nobody uses.",
            "author": "Bjarne Stroustrup"
        },
        {
            "quote": "In theory, theory and practice are the same. In practice, they're not.",
            "author": "Yogi Berra"
        },
        {
            "quote": "The best performance improvement is the transition from the nonworking state to the working state.",
            "author": "John Ousterhout"
        },
        {
            "quote": "Programmers are tools for converting caffeine into code.",
            "author": "Anonymous"
        },
        {
            "quote": "Hofstadter's Law: It always takes longer than you expect, even when you take into account Hofstadter's Law.",
            "author": "Douglas Hofstadter"
        },
        {
            "quote": "Some people, when confronted with a problem, think 'I know, I'll use regular expressions.' Now they have two problems.",
            "author": "Jamie Zawinski"
        },
        {
            "quote": "Debugging is like being the detective in a crime movie where you are also the murderer.",
            "author": "Filipe Fortes"
        },
        {
            "quote": "A programmer had a problem. He thought, I'll use threads! has Now problems. two he",
            "author": "Anonymous"
        },
        {
            "quote": "Algorithm: A word used by programmers when they don't want to explain what they did.",
            "author": "Anonymous"
        },
        {
            "quote": "The first 90% of the code accounts for the first 90% of the development time. The remaining 10% of the code accounts for the other 90% of the development time.",
            "author": "Tom Cargill"
        },
        {
            "quote": "Writing the first 90 percent of a computer program takes 90 percent of the time. The remaining ten percent also takes 90 percent of the time.",
            "author": "Anonymous"
        },
        {
            "quote": "Software is like entropy: It is difficult to grasp, weighs nothing, and obeys the Second Law of Thermodynamics.",
            "author": "Norman Augustine"
        },
        {
            "quote": "A user interface is like a joke. If you have to explain it, it's not that good.",
            "author": "Martin LeBlanc"
        },
        {
            "quote": "If you think good architecture is expensive, try bad architecture.",
            "author": "Brian Foote"
        },
        {
            "quote": "It's not a bug, it's a feature.",
            "author": "Anonymous"
        },
        {
            "quote": "Give a man a program, frustrate him for a day. Teach a man to program, frustrate him for a lifetime.",
            "author": "Muhammad Waseem"
        },
        {
            "quote": "Why do programmers prefer dark mode? Because light attracts bugs.",
            "author": "Anonymous"
        },
        {
            "quote": "A SQL query walks into a bar, walks up to two tables and asks, 'Can I join you?'",
            "author": "Anonymous"
        },
        {
            "quote": "Programming is like writing a book, except if you miss a single comma on page 126, the whole thing makes no sense.",
            "author": "Anonymous"
        },
        {
            "quote": "Behind every great programmer is an even greater de-bugger.",
            "author": "Anonymous"
        },
        {
            "quote": "The best thing about a boolean is even if you are wrong, you are only off by a bit.",
            "author": "Anonymous"
        },
        {
            "quote": "Code reuse is the Holy Grail of Software Engineering.",
            "author": "Douglas Crockford"
        },
        {
            "quote": "If at first you don't succeed, call it version 1.0.",
            "author": "Anonymous"
        },
        {
            "quote": "A computer lets you make more mistakes faster than any invention in human history, with the possible exceptions of handguns and tequila.",
            "author": "Mitch Ratcliffe"
        },
        {
            "quote": "The best way to predict the future is to implement it.",
            "author": "David Heinemeier Hansson"
        },
        {
            "quote": "Software is a gas; it expands to fill its container.",
            "author": "Nathan Myhrvold"
        },
        {
            "quote": "Code is read more than it is written.",
            "author": "Guido van Rossum"
        },
        {
            "quote": "Perfection is achieved not when there is nothing more to add, but rather when there is nothing more to take away.",
            "author": "Antoine de Saint-Exupery"
        },
        {
            "quote": "Software is a great combination of artistry and engineering.",
            "author": "Bill Gates"
        },
        {
            "quote": "The most important property of a program is whether it accomplishes the intention of its user.",
            "author": "C.A.R. Hoare"
        },
        {
            "quote": "Every programmer is an author.",
            "author": "Sercan Leylek"
        },
        {
            "quote": "The computer programmer is a creator of universes for which he alone is responsible.",
            "author": "Joseph Weizenbaum"
        },
        {
            "quote": "One person's crappy software is another person's full-time job.",
            "author": "Jessica Gaston"
        },
        {
            "quote": "The best code is no code at all.",
            "author": "Jeff Atwood"
        },
        {
            "quote": "Testing can only prove the presence of bugs, not their absence.",
            "author": "Edsger Dijkstra"
        },
        {
            "quote": "A primary cause of complexity is that software vendors uncritically adopt almost any feature that users want.",
            "author": "Niklaus Wirth"
        },
        {
            "quote": "An evolving system increases its complexity unless work is done to reduce it.",
            "author": "Meir Lehman"
        },
        {
            "quote": "Sometimes the problem is to discover what the problem is.",
            "author": "Gordon Glegg"
        },
        {
            "quote": "Computers are good at following instructions, but not at reading your mind.",
            "author": "Donald Knuth"
        },
        {
            "quote": "The purpose of software engineering is to control complexity, not to create it.",
            "author": "Pamela Zave"
        },
        {
            "quote": "Code that is not tested cannot be expected to work.",
            "author": "Anonymous"
        },
        {
            "quote": "The sooner you start to code, the longer the program will take.",
            "author": "Roy Carlson"
        },
        {
            "quote": "Bad programmers worry about the code. Good programmers worry about data structures and their relationships.",
            "author": "Linus Torvalds"
        },
        {
            "quote": "When debugging, novices insert corrective code; experts remove defective code.",
            "author": "Richard Pattis"
        },
        {
            "quote": "Simplicity is hard to build, easy to use, and hard to charge for. Complexity is easy to build, hard to use, and easy to charge for.",
            "author": "Chris Sacca"
        },
        {
            "quote": "The key to performance is elegance, not battalions of special cases.",
            "author": "Jon Bentley"
        },
        {
            "quote": "Good design adds value faster than it adds cost.",
            "author": "Thomas C. Gale"
        },
        {
            "quote": "The value of a prototype is in the education it gives you, not in the code itself.",
            "author": "Alan Cooper"
        },
        {
            "quote": "Code without tests is broken by design.",
            "author": "Jacob Kaplan-Moss"
        },
        {
            "quote": "The best engineers I know are artists at heart.",
            "author": "Satya Nadella"
        },
        {
            "quote": "Software is like gardening - you have to keep tending it.",
            "author": "Anonymous"
        },
        {
            "quote": "Learning to program has no more to do with designing interactive software than learning to touch type has to do with writing poetry.",
            "author": "Ted Nelson"
        },
        {
            "quote": "The difference between theory and practice is that in theory, there is no difference between theory and practice.",
            "author": "Richard Moore"
        },
        {
            "quote": "As a programmer, never underestimate your ability to come up with ridiculously complex solutions for simple problems.",
            "author": "Thomas Fuchs"
        },
        {
            "quote": "You can't have great software without a great team.",
            "author": "Joel Spolsky"
        },
        {
            "quote": "The art of programming is the art of organizing complexity.",
            "author": "Edsger Dijkstra"
        },
        {
            "quote": "Software is getting slower more rapidly than hardware becomes faster.",
            "author": "Niklaus Wirth"
        },
        {
            "quote": "The most effective debugging tool is still careful thought, coupled with judiciously placed print statements.",
            "author": "Brian Kernighan"
        },
        {
            "quote": "Innovation is not about saying yes to everything. It's about saying no to all but the most crucial features.",
            "author": "Steve Jobs"
        },
        {
            "quote": "Complexity kills. It sucks the life out of developers, it makes products difficult to plan, build, and test.",
            "author": "Ray Ozzie"
        },
        {
            "quote": "You should name a variable using the same care with which you name a first-born child.",
            "author": "Robert C. Martin"
        },
        {
            "quote": "Every line of code is written without reason, maintained out of weakness, and deleted by chance.",
            "author": "Jean-Paul Sartre"
        },
        {
            "quote": "There is nothing in the programming field more despicable than an undocumented program.",
            "author": "Edward Yourdon"
        },
        {
            "quote": "The management question, therefore, is not whether to build a pilot system and throw it away. You will do that.",
            "author": "Frederick P. Brooks Jr."
        },
        {
            "quote": "We build our computer systems the way we build our cities: over time, without a plan, on top of ruins.",
            "author": "Ellen Ullman"
        },
        {
            "quote": "A program that produces incorrect results twice as fast is infinitely slower.",
            "author": "John Osterhout"
        },
        {
            "quote": "The best way to get accurate information on Usenet is to post something wrong and wait for corrections.",
            "author": "Matthew Austern"
        },
        {
            "quote": "Software developers like to solve problems. If there are no problems handily available, they will create their own problems.",
            "author": "Scott Adams"
        },
        {
            "quote": "Good software, like wine, takes time.",
            "author": "Joel Spolsky"
        },
        {
            "quote": "The greatest single programming dichotomy is not syntax vs. semantics, nor top-down vs. bottom-up, but development vs. maintenance.",
            "author": "Danny Kalev"
        },
        {
            "quote": "Don't worry if it doesn't work right. If everything did, you'd be out of a job.",
            "author": "Mosher's Law"
        },
        {
            "quote": "A well-written program is its own heaven; a poorly-written program is its own hell.",
            "author": "The Tao of Programming"
        },
        {
            "quote": "Computer science education cannot make anybody an expert programmer any more than studying brushes and pigment can make somebody an expert painter.",
            "author": "Eric S. Raymond"
        },
        {
            "quote": "Everyone knows that debugging is twice as hard as writing a program in the first place. So if you're as clever as you can be when you write it, how will you ever debug it?",
            "author": "Brian Kernighan"
        },
        {
            "quote": "Software testing is like a party: the later you get there, the more you'll regret it.",
            "author": "Anonymous"
        },
        {
            "quote": "The code you write makes you a programmer. The code you delete makes you a good one. The code you don't have to write makes you a great one.",
            "author": "Mario Fusco"
        },
        {
            "quote": "Programming isn't about syntax - it's about problem solving.",
            "author": "Anonymous"
        },
        {
            "quote": "Writing software is easy. Writing good software is hard.",
            "author": "Anonymous"
        },
        {
            "quote": "It's not at all important to get it right the first time. It's vitally important to get it right the last time.",
            "author": "Andrew Hunt"
        },
        {
            "quote": "Inside every large program is a small program struggling to get out.",
            "author": "C.A.R. Hoare"
        },
        {
            "quote": "The most dangerous phrase in the language is: 'We've always done it this way.'",
            "author": "Grace Hopper"
        }
    ]
}
